{
  "contentHeader": "Contents:",
  "contentPrologue": "What is the Internet?",
  "contentHistory": "History",
  "contentImprove": "The improving Internet",
  "contentNowadays": "Internet nowadays",
  "contentHungary": "The impact in Hungary",

  "prologueTitle": "What is the Internet?",
  "prolougeContent": "The internet originates from an internationally widespread, English word (internetwork), in Hungarian: <br /><strong>\"network of networks\"</strong>. It is a global computer network, a vast system that connects other computer networks.",

  "historyTitle": "History",
  "historyContent": "In the <strong>1960s</strong>, military developments began to flow into the civilian sphere when the need for a <strong>less vulnerable computer network</strong> was raised in the <strong>USA</strong>, one that could <em>remain operational even after a nuclear attack</em>. In response to the launch of <strong>Sputnik-1</strong>, <strong>President Eisenhower</strong> established <strong>DARPA</strong>, which funded the research. They developed a <strong>decentralized, packet-switched network communication system</strong> (NCP protocol), which was the predecessor of today's <strong>TCP/IP</strong>. In <strong>1969</strong>, the <strong>ARPANET</strong> started operating based on this principle and was used for military and research purposes, such as <strong>electronic mail, file exchange, and remote login</strong>.",

  "improveTitle": "The improving Internet",
  "improveContent": "<strong>In 1972</strong>, the first <strong>email program</strong> appeared, and in <strong>1974</strong>, the term <em>“internet”</em> was used for the first time in a study about the <strong>TCP protocol</strong>. In <strong>1983</strong>, the military part of ARPANET was separated under the name <strong>MILNET</strong>. In <strong>1988</strong>, the first network-spreading <strong>worm virus</strong> appeared. The <strong>National Science Foundation (NSF)</strong> recognized the network's role in scientific research and built the <strong>NSFNET</strong> network, which was connected to <strong>ARPANET</strong>. NSFNET rapidly expanded and is still one of the USA’s main backbone networks. <strong>ARPANET</strong> was discontinued in <strong>1989</strong>, and communication increasingly shifted to private networks. The rapid growth of the internet continued, especially with the spread of the <strong>WWW</strong>, and today the <strong>data traffic</strong> is enormous.",

  "nowadaysTitle": "Internet nowadays",
  "nowadaysContent": "Today, about <strong>four billion people</strong> use internet technologies for personal and business purposes, such as <strong>information searching</strong>, shopping, communication, and entertainment. Current research aims to solve technical problems of the internet, such as the <strong>introduction of the new IPv6 addressing system</strong>, because the current <strong>IPv4 addresses are running out</strong>. Without the introduction of IPv6, expanding the internet would face difficulties, as access needs to be provided to at least <strong>five billion more people</strong>. In <strong>2010, MIT</strong> announced the <em>\"flow switching\"</em> technology, which could <strong>increase data transmission speed by a hundredfold</strong>, but its implementation is hindered by the need to replace routers. Additionally, several cases have pointed out that the <strong>stability of the internet</strong> is not as reliable as originally planned.",

  "hungaryTitle": "The impact in Hungary",
  "hungaryContent": "The first Hungarian domain, <strong>sztaki.hu</strong>, was registered in <strong>1991</strong> for the <strong>Institute for Computer Science and Automation</strong>. The spread of the internet in Hungary was accelerated by dial-up access available on the <strong>Matáv</strong> network starting in <strong>1995</strong>, and in <strong>1999</strong>, business and residential <strong>ISDN services</strong> were introduced. In <strong>2001</strong>, the provider known as <strong>Axelero</strong> made <strong>ADSL technology</strong> available to individuals. After the opening of the wired market, several providers appeared, and in <strong>2000</strong>, <strong>UPC</strong> launched <strong>Chello broadband internet</strong>. By <strong>2007</strong>, <strong>38%</strong> of Hungarian households had internet subscriptions, and the proportion of broadband access also increased. By <strong>2011</strong>, there was significant growth in <strong>mobile internet subscriptions</strong>, which rose to over <strong>2 million</strong>. A <strong>planned gigabyte tax in 2014</strong> was withdrawn due to widespread protests. By the end of the <strong>2010s</strong>, the market became saturated, and the spread of <strong>4G mobile internet</strong> and <strong>fiber optic cable services</strong> grew significantly.",
  "hungaryContentTitle": "The impact in Hungary",

  "footerSource": "source:",
  "footerSourceLink": "https://en.wikipedia.org/wiki/Internet",
  "footerDeveloper": "developer:"
}
