{
  "contentHeader": "Tartalomjegyzék:",
  "contentPrologue": "Mi az Internet?",
  "contentHistory": "Előzmények",
  "contentImprove": " A fejlődés útja",
  "contentNowadays": "Az Intenet manapság",
  "contentHungary": "Az Intenet Magyarországon",

  "prologueTitle": "Mi az Internet?",
  "prolougeContent": "Az internet egy nemzetközileg elterjedt, angol eredetű szóból ered (internetwork), magyarul: <br /><strong>„hálózatok hálózata”</strong>. Az egész világot körülölelő számítógép-hálózat, hatalmas rendszer, amely számítógép-hálózatokat fog össze.",

  "historyTitle": "Előzmények",
  "historyContent": "Az <strong>1960-as években</strong> kezdődött a katonai fejlesztések civil szférába való átáramlása, amikor az <strong>USA-ban felmerült egy kevéssé sebezhető számítógép-hálózat szükségessége</strong>, amely <em>atomtámadás után is működőképes</em> maradhat. <strong>Eisenhower elnök</strong>, válaszul a <strong>Szputnyik-1 fellövésére</strong>, megalapította a <strong>DARPA-t</strong>, amely finanszírozta a kutatásokat. Kidolgoztak egy <strong>többközpontú, csomagkapcsolt hálózati kommunikációs rendszert</strong> (NCP protokoll), amely a mai <strong>TCP/IP elődje</strong> volt. Az <strong>ARPANET 1969-ben</strong> ezen az elven kezdett működni, és katonai, valamint kutatási célokra használták, például <strong>elektronikus levelezésre, fájlok cseréjére és távoli bejelentkezésre</strong>.",

  "improveTitle": "A fejlődés útja",
  "improveContent": "<strong>1972-ben</strong> megjelent az első <strong>e-mail-program</strong>, <strong>1974-ben</strong> pedig először használták az <em>„internet”</em> kifejezést egy <strong>TCP protokollról</strong> szóló tanulmányban. <strong>1983-ban</strong> az ARPANET katonai részét leválasztották <strong>MILNET</strong> néven. <strong>1988-ban</strong> megjelent az első hálózaton terjedő <strong>féregvírus</strong>. A <strong>National Science Foundation (NSF)</strong> felismerte a hálózat tudományos kutatásban játszott szerepét, és kiépítette az <strong>NSFNET</strong> hálózatot, amelyet összekapcsoltak az <strong>ARPANET-tel</strong>. Az NSFNET gyorsan bővült, és ma is az USA egyik fő gerinchálózata. Az <strong>ARPANET 1989-ben</strong> megszűnt, és a kommunikáció egyre inkább magánhálózatokon zajlik. Az internet gyors növekedése folytatódott, különösen a <strong>WWW</strong> elterjedésével, és az <strong>adatforgalom</strong> ma hatalmas méreteket ölt.",

  "nowadaysTitle": "Az Internet manapság",
  "nowadaysContent": "Manapság körülbelül <strong>négymilliárd ember</strong> használja az internetes technológiákat személyes és üzleti célokra, például <strong>információkeresésre</strong>, vásárlásra, kapcsolattartásra és szórakozásra. Jelenleg folyó kutatások célja az internet technikai problémáinak megoldása, mint például az <strong>új IPv6 címzési rendszer bevezetése</strong>, mivel a jelenlegi <strong>IPv4 címek kifogyóban vannak</strong>. Az IPv6 bevezetése nélkül az internet bővítése nehézségekbe ütközne, mivel még legalább <strong>ötmilliárd ember</strong> számára kellene hozzáférést biztosítani. <strong>2010-ben az MIT</strong> bejelentette a <em>\"flow switching\"</em> technológiát, amely <strong>százszorosára növelhetné az adattovábbítás sebességét</strong>, de ennek bevezetését akadályozza, hogy ehhez le kellene cserélni a routereket. Emellett több eset is rámutatott arra, hogy az <strong>internet stabilitása</strong> nem olyan biztos, mint ahogyan tervezték.",

  "hungaryTitle": "Az Intenet Magyarországon",
  "hungaryContent": "Az első magyarországi domaint, a <strong>sztaki.hu-t</strong>  <strong>1991-ben</strong> jegyezték be a <strong>Számítástechnikai és Automatizálási Kutatóintézet</strong> számára. Az internet hazai elterjedését gyorsította a <strong>Matáv</strong> hálózatán <strong>1995-től</strong> elérhető telefonmodemes hozzáférés, majd <strong>1999-ben</strong> megjelent az üzleti és lakossági <strong>ISDN szolgáltatás</strong>. <strong>2001-ben</strong> az <strong>Axelero</strong> néven futó szolgáltató elérhetővé tette az <strong>ADSL technológiát</strong> magánszemélyeknek is. A vezetékes piac megnyitása után több szolgáltató is megjelent, míg a <strong>UPC</strong> <strong>2000-ben</strong> indította el a <strong>Chello szélessávú internetet</strong>. <strong>2007-ben</strong> a magyar háztartások <strong>38%-a</strong> rendelkezett internet-előfizetéssel, a szélessávú hozzáférések aránya is nőtt. <strong>2011-re</strong> jelentős növekedést mutattak a <strong>mobilinternet-előfizetések</strong>, amelyek száma több mint <strong>2 millióra</strong> emelkedett. Egy <strong>2014-es tervezett gigabyte-adót</strong> a széleskörű tiltakozások miatt visszavonták. A <strong>2010-es évek végére</strong> a piac telített lett, a <strong>4G mobilinternet</strong> és az <strong>optikai kábeles szolgáltatások</strong> elterjedése pedig számottevően nőtt.",
  "hungaryContentTitle": "Az Internet Magyarországon",

  "footerSource": "forrás:",
  "footerSourceLink": "https://hu.wikipedia.org/wiki/Internet",
  "footerDeveloper": "készítette:"
}
